[
    {
        "symbol": "ATGE",
        "price": 95.6,
        "beta": 0.81372064,
        "volAvg": 415439,
        "mktCap": 3473004600,
        "lastDiv": 0,
        "range": "78.56-156.26",
        "changes": -2.42,
        "companyName": "Adtalem Global Education Inc.",
        "currency": "USD",
        "cik": "0000730464",
        "isin": "US00737L1035",
        "cusip": "00737L103",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Education & Training Services",
        "website": "https://www.adtalem.com",
        "description": "Adtalem Global Education Inc. provides workforce solutions worldwide. It operates through three segments, Chamberlain, Walden, and Medical and Veterinary. The Chamberlain segment offers degree and non-degree programs in the nursing and health professions postsecondary education industry. This segment operates Chamberlain University. The Walden segment offers online certificates, bachelor's, master's, and doctoral degrees, including nursing, education, counseling, business, psychology, public health, social work and human services, public administration and public policy, and criminal justice. This segment also operates Walden University. The Medical and Veterinary segment provides degree and non-degree programs in the medical and veterinary postsecondary education industry. This segment operates American University of the Caribbean School of Medicine, Ross University School of Medicine, and Ross University School of Veterinary Medicine. The company was formerly known as DeVry Education Group Inc. and changed its name to Adtalem Global Education Inc. in May 2017. Adtalem Global Education Inc. was incorporated in 1987 and is based in Chicago, Illinois.",
        "ceo": "Stephen W. Beard",
        "sector": "Consumer Defensive",
        "country": "US",
        "fullTimeEmployees": "4624",
        "phone": "866 374 2678",
        "address": "500 West Monroe Street",
        "city": "Chicago",
        "state": "IL",
        "zip": "60661",
        "dcfDiff": -174.5737,
        "dcf": 269.2836959351726,
        "image": "https://images.financialmodelingprep.com/symbol/ATGE.png",
        "ipoDate": "1991-06-21",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]