[
    {
        "symbol": "BIG",
        "price": 0.4968,
        "beta": 2.228,
        "volAvg": 2399564,
        "mktCap": 14746018,
        "lastDiv": 0,
        "range": "0.4-8.41",
        "changes": 0.0415,
        "companyName": "Big Lots, Inc.",
        "currency": "USD",
        "cik": "0000768835",
        "isin": "US0893021032",
        "cusip": "089302103",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Discount Stores",
        "website": "https://www.biglots.com",
        "description": "Big Lots, Inc., through its subsidiaries, operates as a home discount retailer in the United States. The company offers products under various merchandising categories, such as furniture category that includes upholstery, mattresses, case goods, and ready-to-assemble departments; seasonal category, which comprises patio furniture, gazebos, Christmas trim, and other holiday departments; soft home category that consists of fashion and utility bedding, bath, window, decorative textile, home organization, area rugs, home décor, and frames departments; and food category that includes beverage and grocery, candy and snacks, specialty foods, and pet departments. It also provides merchandise under the consumables category, which comprises health, beauty and cosmetics, plastics, paper, and chemical departments; hard home category, including small appliances, tabletops, and food preparation and stationery products; home maintenance and organization products; toys; and accessories category consisting of apparel, electronics, jewelry, apparel, and hosiery departments. As of January 29, 2022, it operated 1,431 stores in 47 states and an e-commerce platform. Big Lots, Inc. was founded in 1967 and is headquartered in Columbus, Ohio.",
        "ceo": "Bruce K. Thorn",
        "sector": "Consumer Defensive",
        "country": "US",
        "fullTimeEmployees": "10000",
        "phone": "614 278 6800",
        "address": "4900 East Dublin Granville Road",
        "city": "Columbus",
        "state": "OH",
        "zip": "43081",
        "dcfDiff": 2.33513,
        "dcf": 19.1951,
        "image": "https://images.financialmodelingprep.com/symbol/BIG.png",
        "ipoDate": "1985-06-20",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]