[
    {
        "symbol": "BSET",
        "price": 14.75,
        "beta": 0.971,
        "volAvg": 27215,
        "mktCap": 128114223,
        "lastDiv": 0.8,
        "range": "13.58-19.75",
        "changes": 0,
        "companyName": "Bassett Furniture Industries, Incorporated",
        "currency": "USD",
        "cik": "0000010329",
        "isin": "US0702031040",
        "cusip": "070203104",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Furnishings, Fixtures & Appliances",
        "website": "https://www.bassettfurniture.com",
        "description": "Bassett Furniture Industries, Incorporated engages in the manufacture, marketing, and retail of home furnishings in the United States and internationally. It operates through three segments: Wholesale, Retail \u0096company-owned Stores, and Logistical Services. The company engages in the design, manufacture, sourcing, sale, and distribution of furniture products to a network of company-owned retail stores and licensee-owned stores, and independent furniture retailers; and wood and upholstery operations. As of November 27, 2021, it operated a network of 63 company-owned stores and 34 licensee-owned stores. It also provides shipping, and warehousing services to customers in the furniture industry. In addition, the company owns and leases retail store properties; and distributes its products through other multi-line furniture stores, Bassett galleries or design centers, mass merchants, and specialty stores, as well as sells its products online. Bassett Furniture Industries, Incorporated was incorporated in 1902 and is based in Bassett, Virginia.",
        "ceo": "Robert H. Spilman Jr.",
        "sector": "Consumer Cyclical",
        "country": "US",
        "fullTimeEmployees": "1228",
        "phone": "276 629 6000",
        "address": "3525 Fairystone Park Highway",
        "city": "Bassett",
        "state": "VA",
        "zip": "24055",
        "dcfDiff": 15.06153,
        "dcf": -0.46152972676274684,
        "image": "https://images.financialmodelingprep.com/symbol/BSET.png",
        "ipoDate": "1980-03-17",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]