[
    {
        "symbol": "CBB",
        "price": 15.48,
        "beta": 0.362991,
        "volAvg": 567344,
        "mktCap": 0,
        "lastDiv": 141.59400000000002,
        "range": "15.49-15.5",
        "changes": 0,
        "companyName": "Cincinnati Bell Inc.",
        "currency": "USD",
        "cik": "0000716133",
        "isin": "US1718715022",
        "cusip": "171871502",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Telecommunications Services",
        "website": "http://www.cincinnatibell.com",
        "description": "Cincinnati Bell Inc., together with its subsidiaries, provides diversified telecommunications and technology services to residential and business customers in the United States. It operates in two segments, Entertainment and Communications, and IT Services and Hardware. The Entertainment and Communications segment offers data services, including high-speed Internet access, data transport, and interconnection services, as well as metro-Ethernet products; and voice local services, as well as long distance, digital trunking, switched access, and other value-added services, such as caller identification, voicemail, call waiting, and call return. This segment also provides video services comprising entertainment channels, including digital music, local, movie, and sports programming with high-definition channels, parental controls, HD DVR, and video on-demand. In addition, this segment undertakes wiring projects for business customers; and offers advertising, directory assistance, maintenance, and information services. The IT Services and Hardware segment provides consulting services consisting of IT staffing and project-based engagements, including engineering and installation of voice, connectivity and IT technologies, development of digital application solutions, and staff augmentation; and hosted solutions comprising converged IP communications platforms of data, voice, video, and mobility applications. This segment also offers cloud services, such as virtual data center, storage, and backup services; and monitoring and managing technology environments and applications, as well as sells, architects, and installs telecommunications and IT infrastructure equipment. The company was founded in 1873 and is headquartered in Cincinnati, Ohio.",
        "ceo": "Leigh Fox",
        "sector": "Communication Services",
        "country": "US",
        "fullTimeEmployees": "4600",
        "phone": "15133979900",
        "address": "221 E 4th St",
        "city": "Cincinnati",
        "state": "OH",
        "zip": "45202",
        "dcfDiff": 0.244,
        "dcf": 15.724,
        "image": "https://images.financialmodelingprep.com/symbol/CBB.png",
        "ipoDate": "2013-01-24",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]