[
    {
        "symbol": "CIT",
        "price": 53.5,
        "beta": 1.471688,
        "volAvg": 1306853,
        "mktCap": 0,
        "lastDiv": 7.505000000000004,
        "range": "51.4-54.325",
        "changes": 2.16,
        "companyName": "CIT Group Inc.",
        "currency": "USD",
        "cik": "0001171825",
        "isin": "US1255818015",
        "cusip": "125581801",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Banks - Regional",
        "website": "https://www.cit.com",
        "description": "CIT Group Inc. operates as the holding company for CIT Bank, N.A. that provides banking and related services to commercial and individual customers. The company operates through Commercial Banking and Consumer Banking segments. The Commercial Banking segment provides a range of commercial lending, leasing, and deposit products; loans comprising revolving lines of credit, term loans, unsecured loans, collateral-backed loans, asset-based loans, commercial real estate loans, and cash flow loans; and ancillary services and products, including cash management, capital markets, and advisory services primarily to small and middle market companies. This segment also offers asset management, factoring, receivable management, and secured financing services; supply chain financing, leasing and equipment financing to small businesses and middle market, and railroads and shippers. The Consumer Banking segment provides checking, savings, money market, and individual retirement accounts; time deposits and certificates of deposit; residential mortgage loans; small business administration loans; payment solutions; and fiduciary services. The company also offers leasing and advisory, and online banking services. It operates through a network of approximately 60 branches located in southern California. CIT Group Inc. was founded in 1908 and is based in New York, New York.",
        "ceo": "Ellen Alemany",
        "sector": "Financial Services",
        "country": "US",
        "fullTimeEmployees": "3812",
        "phone": "19737405000",
        "address": "1 Cit Dr",
        "city": "Livingston",
        "state": "NJ",
        "zip": "10036",
        "dcfDiff": 40.3171,
        "dcf": 93.8171,
        "image": "https://images.financialmodelingprep.com/symbol/CIT.png",
        "ipoDate": "2002-07-01",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]