[
    {
        "symbol": "CS",
        "price": 0.8858,
        "beta": 1.191489,
        "volAvg": 26246510,
        "mktCap": 3496163992,
        "lastDiv": 0.05,
        "range": "0.8153-6.08",
        "changes": 0.0087,
        "companyName": "Credit Suisse Group AG",
        "currency": "USD",
        "cik": "0001159510",
        "isin": "US2254011081",
        "cusip": "225401108",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Banks - Diversified",
        "website": "https://www.credit-suisse.com",
        "description": "Credit Suisse Group AG, together with its subsidiaries, provides various financial services in Switzerland, Europe, the Middle East, Africa, the Americas, and Asia Pacific. The company offers wealth management solutions, including investment advice and discretionary asset management services; risk management solutions, such as managed investment products; and wealth planning, succession planning, and trust services. It also provides financing and lending solutions, including consumer credit and real estate mortgage lending, real asset lending relating to ship, and aviation financing for UHNWI; standard and structured hedging, and lombard lending solutions, as well as collateral trading services; and investment banking solutions, such as global securities sales, trading and execution, capital raising, and advisory services. In addition, the company offers banking solutions, such as payments, accounts, debit and credit cards, and product bundles; asset management products; equity and debt underwriting, and advisory services; cash equities, equity derivatives, and convertibles, as well as prime services; and fixed income products, such as credit, securitized, macro, emerging markets, financing, structured credit, and other products. Further, it provides HOLT, a framework for assessing the performance of approximately 20,000 companies; and equity and fixed income research services. The company serves private and institutional clients; ultra-high-net-worth individuals, high-net-worth individuals, and affluent and retail clients; corporate clients, small and medium-sized enterprises, external asset managers, financial institutions, and commodity traders; and pension funds, hedge funds, governments, foundations and endowments, corporations, entrepreneurs, private individuals, financial sponsors, and sovereign clients. As of December 31, 2021, it operated through a network of 311 offices and branches. The company was founded in 1856 and is based in Zurich, Switzerland.",
        "ceo": "Ulrich Korner",
        "sector": "Financial Services",
        "country": "CH",
        "fullTimeEmployees": "48150",
        "phone": "41 44 333 11 11",
        "address": "Paradeplatz 8",
        "city": "Zurich",
        "state": null,
        "zip": "8001",
        "dcfDiff": 68.1133,
        "dcf": 71.6733,
        "image": "https://images.financialmodelingprep.com/symbol/CS.png",
        "ipoDate": "2001-09-25",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": true,
        "isFund": false
    }
]