[
    {
        "symbol": "EVY",
        "price": 15.17,
        "beta": 0,
        "volAvg": 0,
        "mktCap": 81945746,
        "lastDiv": 0,
        "range": "15.16-15.18",
        "changes": 0,
        "companyName": "Eaton Vance New York Municipal Income Trust",
        "currency": "USD",
        "cik": "0001074685",
        "isin": "US27826W1045",
        "cusip": "",
        "exchange": "New York Stock Exchange Arca",
        "exchangeShortName": "AMEX",
        "industry": "Asset Management - Income",
        "website": "http://funds.eatonvance.com/New-York-Municipal-Income-Trust-EVY.php",
        "description": "Eaton Vance New York Municipal Income Trust is a non-diversified, closed-end management investment company. The Trust's investment objective is to provide current income exempt from regular federal income tax and taxes in its specified state. The Trust invests primarily in debt securities issued by New York municipalities. The Trust invests in various sectors, including cogeneration, electric utilities, escrowed/prerefunded, hospital, housing, industrial development revenue, water and sewer, special tax, real estate, toll road, healthcare-acute, transportation, student loan and senior living/life care. The Trust may invest in residual interest bonds, also referred to as inverse floating rate securities, whereby it may sell a variable or fixed rate bond for cash to a Special-Purpose Vehicle (the SPV), while at the same time, buying a residual interest in the assets and cash flows of the SPV. The Trust's investment advisor is Eaton Vance Management.",
        "ceo": "",
        "sector": "Financial Services",
        "country": "US",
        "fullTimeEmployees": "0",
        "phone": "16174828260",
        "address": "Two International Place",
        "city": "",
        "state": "",
        "zip": "",
        "dcfDiff": 9.99031,
        "dcf": 5.17969,
        "image": "https://images.financialmodelingprep.com/symbol/EVY.png",
        "ipoDate": "1999-02-15",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": true
    }
]