[
    {
        "symbol": "GCO",
        "price": 29.65,
        "beta": 2.271,
        "volAvg": 159942,
        "mktCap": 320074745,
        "lastDiv": 0,
        "range": "16.19-44.8",
        "changes": 0.64,
        "companyName": "Genesco Inc.",
        "currency": "USD",
        "cik": "0000018498",
        "isin": "US3715321028",
        "cusip": "371532102",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Apparel - Retail",
        "website": "https://genesco.com",
        "description": "Genesco Inc. operates as a retailer and wholesaler of footwear, apparel, and accessories. The company operates through four segments: Journeys Group, Schuh Group, Johnston & Murphy Group, and Licensed Brands. The Journeys Group segment offers footwear and accessories through the Journeys, Journeys Kidz, and Little Burgundy retail chains, as well as through e-commerce and catalogs for young men, women, and children. The Schuh Group segment operates Schuh retail footwear stores that offer casual and athletic footwear, as well as sells footwear through e-commerce. The Johnston & Murphy Group segment is involved in the retail and e-commerce operations; and wholesale distribution of men's dress and casual footwear, apparel, and accessories, as well as women's footwear and accessories. The Licensed Brands segment markets footwear under the Levi's, Dockers, and G.H. Bass brands for men, women, and children, as well as designs and manufactures the STARTER and ETONIC brands footwear. As of January 29, 2022, the company operated approximately 1,425 retail stores in the United States, Puerto Rico, Canada, the United Kingdom, and the Republic of Ireland primarily under the Journeys, Journeys Kidz, Schuh, Little Burgundy, and Johnston & Murphy names. Its e-commerce websites include journeys.com, journeyskidz.com, journeys.ca, schuh.co.uk, schuh.ie, schuh.eu, johnstonmurphy.com, littleburgundyshoes.com, johnstonmurphy.ca, nashvilleshoewarehouse.com, and dockersshoes.com. Genesco Inc. was incorporated in 1924 and is headquartered in Nashville, Tennessee.",
        "ceo": "Mimi Eckel Vaughn",
        "sector": "Consumer Cyclical",
        "country": "US",
        "fullTimeEmployees": "5400",
        "phone": "615 367 7000",
        "address": "Genesco Park",
        "city": "Nashville",
        "state": "TN",
        "zip": "37217-2895",
        "dcfDiff": 27.79907,
        "dcf": 1.7559309693956429,
        "image": "https://images.financialmodelingprep.com/symbol/GCO.png",
        "ipoDate": "1939-07-15",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]