[
    {
        "symbol": "HBI",
        "price": 6.56,
        "beta": 1.472,
        "volAvg": 9153015,
        "mktCap": 2320757440,
        "lastDiv": 0,
        "range": "3.96-9.1",
        "changes": -0.05,
        "companyName": "Hanesbrands Inc.",
        "currency": "USD",
        "cik": "0001359841",
        "isin": "US4103451021",
        "cusip": "410345102",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Apparel - Manufacturers",
        "website": "https://www.hanes.com",
        "description": "Hanesbrands Inc., a consumer goods company, designs, manufactures, sources, and sells a range of basic apparel for men, women, and children. The company operates through three segments: Innerwear, Activewear, and International. It sells men's underwear, women's panties, children's underwear, activewear, and socks, as well as intimate apparel, such as bras and shapewears; home goods; and T-shirts, fleece, performance apparel, sport shirts, performance T-shirts and shorts, sports bras, teamwear, and thermals, as well as licensed logo apparel in collegiate bookstores, mass retailers, and other channels. The company licenses its Champion name for footwear and sports accessories. Hanesbrands Inc. provides its products primarily under the Hanes, Champion, Maidenform, JMS/Just My Size, Bali, Polo Ralph Lauren, Playtex, DKNY, Alternative, Gear for Sports, Comfortwash, Hanes Beefy-T, Bonds, DIM, Sheridan, Bras N Things, Lovable, Wonderbra, Berlei, Abanderado, Shock Absorber, Zorba, Explorer, Sol y Oro, Maidenform, Rinbros, and Bellinda brand names. The company markets its products through retailers, wholesalers, and third-party embellishers. As of January 2, 2022, it operated 216 retail and direct outlet stores in the United States and the Commonwealth of Puerto Rico, as well as 626 retail and outlet stores internationally. The company also sells its products in Europe, Australia, Asia, Latin America, Canada, the Middle East, Africa, Mexico, and Brazil. Hanesbrands Inc. was founded in 1901 and is headquartered in Winston-Salem, North Carolina.",
        "ceo": "Stephen B. Bratspies",
        "sector": "Consumer Cyclical",
        "country": "US",
        "fullTimeEmployees": "38000",
        "phone": "336 519 8080",
        "address": "1000 East Hanes Mill Road",
        "city": "Winston-Salem",
        "state": "NC",
        "zip": "27105",
        "dcfDiff": 8.9623,
        "dcf": -2.4472975888213986,
        "image": "https://images.financialmodelingprep.com/symbol/HBI.png",
        "ipoDate": "2006-09-06",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]