[
    {
        "symbol": "HFC",
        "price": 36.39,
        "beta": 1.592027,
        "volAvg": 2504388,
        "mktCap": 7139208540,
        "lastDiv": 22.15245000000001,
        "range": "35.05-37.26",
        "changes": 0.709999,
        "companyName": "HF Sinclair Corporation",
        "currency": "USD",
        "cik": "0000048039",
        "isin": "US4361061082",
        "cusip": "436106108",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Oil & Gas Refining & Marketing",
        "website": "https://www.hollyfrontier.com",
        "description": "HollyFrontier Corporation operates as an independent petroleum refiner and marketer in the United States. The company operates through three segments: Refining, Lubricants and Specialty Products, and HEP. It primarily produces high-value light products, such as gasoline, diesel and jet fuel, and specialty lubricant products, as well as specialty and modified asphalt. The company offers its products to other refiners, convenience store chains, independent marketers, liquid petroleum gases and other retailers, truck stop chains, wholesalers, railroads, governmental entities, and paving contractors or manufacturers, as well as for commercial airline use. It owns and operates five refineries with a combined crude oil processing capacity of approximately 554,000 barrels per day in El Dorado, Kansas; Tulsa, Oklahoma; Anacortes, Washington; Artesia, New Mexico; and Woods Cross, Utah. The company also owns and operates vacuum distillation and other facilities in Lovington, New Mexico, as well as asphalt terminals in Arizona, New Mexico, and Oklahoma. Its refineries serve markets in the Mid-Continent, Southwest, and Rocky Mountain regions of the United States. In addition, the company produces base oils and other specialized lubricant products; and owns and operates logistic assets consisting of petroleum product and crude oil pipelines, terminals, tankage, loading rack facilities, and refinery processing units. The company was formerly known as Holly Corporation and changed its name to HollyFrontier Corporation as a result of its merger with Frontier Oil Corporation in July 2011. HollyFrontier Corporation was incorporated in 1947 and is headquartered in Dallas, Texas.",
        "ceo": "Michael Jennings",
        "sector": "Energy",
        "country": "US",
        "fullTimeEmployees": "4208",
        "phone": "12148713555",
        "address": "2828 N Harwood St Ste 1300",
        "city": "Dallas",
        "state": "TX",
        "zip": "75201",
        "dcfDiff": 1.44228,
        "dcf": 37.8323,
        "image": "https://images.financialmodelingprep.com/symbol/HFC.png",
        "ipoDate": "2004-04-26",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]