[
    {
        "symbol": "IHRT",
        "price": 2.91,
        "beta": 1.925,
        "volAvg": 852604,
        "mktCap": 375258212,
        "lastDiv": 0,
        "range": "0.95-3.51",
        "changes": -0.06,
        "companyName": "iHeartMedia, Inc.",
        "currency": "USD",
        "cik": "0001400891",
        "isin": "US45174J5092",
        "cusip": "45174J509",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Broadcasting",
        "website": "https://www.iheartmedia.com",
        "description": "iHeartMedia, Inc. operates as a media and entertainment company worldwide. It operates through three segments: Multiplatform Group, Digital Audio Group, and Audio & Media Services Group. The Multiplatform Group segment offers broadcast radio stations, sponsorship, and live and virtual events; and operates Premiere Networks, a national radio network that produces, distributes, or represents approximately 120 syndicated radio programs and services to approximately 6,400 radio station affiliates. It also delivers real-time traffic flow and incident information, and weather updates, sports, and news through approximately 2,100 radio stations and 170 television affiliates, and Internet and mobile partnerships. As of December 31, 2021, this segment owned 863 radio stations, which included 249 AM and 614 FM radio stations. The Digital Audio Group segment provides podcasting, digital sites, newsletters, digital services, and programs; and iHeartRadio, a mobile app and web-based service for radio stations, digital-only stations, custom artist stations, and podcasts. The Audio and Media Services Group segment engages in the media representation business. This segment also provides cloud and on-premises broadcast software, such as radio and television automation, music scheduling, newsroom automation, advertising sales management, disaster recovery solutions; and real-time audio recognition technology to approximately 10,000 radio and television stations, cable channels, record labels, advertisers, and agencies, as well as media streaming and research services. The company was formerly known as CC Media Holdings, Inc. and changed its name to iHeartMedia, Inc. in September 2014. iHeartMedia, Inc. is headquartered in San Antonio, Texas.",
        "ceo": "Robert W. Pittman",
        "sector": "Communication Services",
        "country": "US",
        "fullTimeEmployees": "8080",
        "phone": "210 822 2828",
        "address": "20880 Stone Oak Parkway",
        "city": "San Antonio",
        "state": "TX",
        "zip": "78258",
        "dcfDiff": 2.07133,
        "dcf": 9.82133,
        "image": "https://images.financialmodelingprep.com/symbol/IHRT.png",
        "ipoDate": "2019-07-01",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]