[
    {
        "symbol": "ILMN",
        "price": 119.99,
        "beta": 1.398,
        "volAvg": 1650878,
        "mktCap": 18442463000,
        "lastDiv": 0,
        "range": "68.7-156.66",
        "changes": -3.55,
        "companyName": "Illumina, Inc.",
        "currency": "USD",
        "cik": "0001110803",
        "isin": "US4523271090",
        "cusip": "452327109",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Medical - Diagnostics & Research",
        "website": "https://www.illumina.com",
        "description": "Illumina, Inc. provides sequencing and array-based solutions for genetic and genomic analysis. Its products and services serve customers in a range of markets enabling the adoption of genomic solutions in research and clinical settings for applications in the life sciences, oncology, reproductive health, agriculture, and other emerging segments. The company provides instruments and consumables used in genetic analysis; and genotyping and sequencing services, instrument service contracts, and development and licensing agreements, as well as cancer detection testing services. Its customers include genomic research centers, academic institutions, government laboratories, and hospitals, as well as pharmaceutical, biotechnology, commercial molecular diagnostic laboratories, and consumer genomics companies. The company markets and distributes its products directly to customers in North America, Europe, Latin America, and the Asia-Pacific region, as well as sells through life-science distributors in various markets within Europe, the Asia-Pacific region, Latin America, the Middle East, and Africa. The company was incorporated in 1998 and is based in San Diego, California.",
        "ceo": "Jacob Thaysen",
        "sector": "Healthcare",
        "country": "US",
        "fullTimeEmployees": "8970",
        "phone": "858 202 4500",
        "address": "5200 Illumina Way",
        "city": "San Diego",
        "state": "CA",
        "zip": "92122",
        "dcfDiff": 73.41436,
        "dcf": 46.82563798651831,
        "image": "https://images.financialmodelingprep.com/symbol/ILMN.png",
        "ipoDate": "2000-07-28",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]