[
    {
        "symbol": "LLL",
        "price": 0.8391,
        "beta": 1.493736,
        "volAvg": 259770,
        "mktCap": 10773960,
        "lastDiv": 0,
        "range": "0.7231-7.16",
        "changes": -0.0408,
        "companyName": "JX Luxventure Limited",
        "currency": "USD",
        "cik": "0001546383",
        "isin": "",
        "cusip": "",
        "exchange": "NASDAQ Capital Market",
        "exchangeShortName": "NASDAQ",
        "industry": "Apparel - Manufacturers",
        "website": "https://en.jxluxventure.com",
        "description": "JX Luxventure Limited, a casual menswear company, designs, develops, markets, and sells fashion menswear products in the People's Republic of China. The company operates through five segments: Wholesale, Retail, Contract Manufacturing, Tourism Service, and Cross-Border E-Commerce. It offers apparel products, including cotton and down jackets, sweaters, suits, shirts, T-shirts, jeans, and trousers; accessories, such as shoes, bags, belts, socks, and caps; and footwear for urban males between the ages of 20 and 40. As of December 31, 2021, the company owned and operated 1 corporate store and 29 franchised stores. It also provides packaged group tour services online through the Luxventure platform; and engages in the offline wholesale of health care, personal care, cosmetics, maternal and child, pet-related, and universal cuisine and household products, as well as online. In addition, the company offers tourism and selling carrier services. The company was formerly known as KBS Fashion Group Limited and changed its name to JX Luxventure Limited in October 2021. JX Luxventure Limited is headquartered in Haikou, the People's Republic of China.",
        "ceo": "",
        "sector": "Consumer Cyclical",
        "country": "CN",
        "fullTimeEmployees": "415",
        "phone": "86 595 8850 7988",
        "address": "Xin Fengge Building",
        "city": "Shishi",
        "state": "",
        "zip": "570100",
        "dcfDiff": 6.1276,
        "dcf": 7.1576,
        "image": "https://images.financialmodelingprep.com/symbol/LLL.png",
        "ipoDate": "2013-03-07",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]