[
    {
        "symbol": "MGI",
        "price": 10.99,
        "beta": 0.994722,
        "volAvg": 3394929,
        "mktCap": 1074114244,
        "lastDiv": 3.6799999999999997,
        "range": "8.59-11.0",
        "changes": 0,
        "companyName": "MoneyGram International, Inc.",
        "currency": "USD",
        "cik": "0001273931",
        "isin": "US60935Y2081",
        "cusip": "60935Y208",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Financial - Credit Services",
        "website": "https://corporate.moneygram.com",
        "description": "MoneyGram International, Inc., together with its subsidiaries, provides cross-border peer-to-peer payments and money transfer services in the United States and internationally. The company operates through two segments, Global Funds Transfer and Financial Paper Products. The Global Funds Transfer segment offers money transfer services and bill payment services through third-party agents, including retail chains, independent retailers, post offices, banks, and other financial institutions; and digital solutions, such as moneygram.com, account deposit, and kiosk-based services, as well as mobile app solutions. The Financial Paper Products segment provides money orders to consumers through its agents and financial institutions under the MoneyGram brand and on a private label or co-branded basis with various agents and financial institutions; and official check outsourcing services for banks and credit unions. MoneyGram International, Inc. was incorporated in 2003 and is based in Dallas, Texas.",
        "ceo": "W. Alexander Holmes",
        "sector": "Financial Services",
        "country": "US",
        "fullTimeEmployees": "3186",
        "phone": "214 999 7552",
        "address": "2828 N. Harwood Street",
        "city": "Dallas",
        "state": "TX",
        "zip": "75201",
        "dcfDiff": 23.4016,
        "dcf": 34.2716,
        "image": "https://images.financialmodelingprep.com/symbol/MGI.png",
        "ipoDate": "2004-06-30",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]