[
    {
        "symbol": "ODP",
        "price": 27.81,
        "beta": 1.418,
        "volAvg": 883675,
        "mktCap": 836636040,
        "lastDiv": 0,
        "range": "11.85-32.21",
        "changes": -0.07,
        "companyName": "The ODP Corporation",
        "currency": "USD",
        "cik": "0000800240",
        "isin": "US88337F1057",
        "cusip": "88337F105",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Specialty Retail",
        "website": "https://investor.theodpcorp.com",
        "description": "The ODP Corporation provides business services and supplies, products, and digital workplace technology solutions for small, medium, and enterprise businesses. The company operates in two divisions, Business Solutions and Retail. The Business Solutions division offers office supply products and services, cleaning and breakroom supplies, technology services, copy and print services, and office furniture products and services through sales forces, catalogs, and telesales, as well as through Internet Websites in the United States, Puerto Rico, the U.S. Virgin Islands, and Canada. The Retail division operates a chain of retail stores, which offer office supplies; technology products and solutions; business machines and related supplies; print, cleaning, breakroom, and facilities products; and furniture, as well as printing, copying, mailing, and shipping services. As of December 31, 2021, this division operated 1,038 retail stores in the United States, Puerto Rico, and the U.S. Virgin Islands. The company offers its products under various brands, including Office Depot, OfficeMax, and Grand&Toy, as well as others. The ODP Corporation was incorporated in 1986 and is headquartered in Boca Raton, Florida.",
        "ceo": "Gerry P. Smith",
        "sector": "Consumer Cyclical",
        "country": "US",
        "fullTimeEmployees": "19000",
        "phone": "561 438 4800",
        "address": "6600 North Military Trail",
        "city": "Boca Raton",
        "state": "FL",
        "zip": "33496",
        "dcfDiff": -45.65451,
        "dcf": 68.57450964301856,
        "image": "https://images.financialmodelingprep.com/symbol/ODP.png",
        "ipoDate": "1988-06-01",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]