[
    {
        "symbol": "PBCT",
        "price": 19.41,
        "beta": 0.930392,
        "volAvg": 7401366,
        "mktCap": 0,
        "lastDiv": 13.387664999999995,
        "range": "19.34-20.39",
        "changes": 0,
        "companyName": "People's United Financial, Inc.",
        "currency": "USD",
        "cik": "0001378946",
        "isin": "US7127041058",
        "cusip": "712704105",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Banks - Regional",
        "website": "https://www.peoples.com",
        "description": "People's United Financial, Inc. operates as the bank holding company for People's United Bank, National Association that provides commercial banking, retail banking, and wealth management services to individual, corporate, and municipal customers. The company offers commercial deposit products, commercial real estate lending, middle market and business banking, equipment financing, mortgage warehouse and asset-based lending, treasury management services, and capital market capabilities. It also provides consumer lending, including residential mortgage and home equity lending; and consumer deposit gathering services. In addition, the company offers brokerage, financial and investment advisory, investment management, life insurance, financial management and planning, and non-institutional trust services, as well as cash management, municipal banking, online banking, investment trading, and telephone banking services. As of March 04, 2022, it operated approximately 400 retail locations in Connecticut, New York, Massachusetts, Vermont, New Hampshire, and Maine. The company also operates 562 ATMs. People's United Financial, Inc. was founded in 1842 and is headquartered in Bridgeport, Connecticut. As of April 1, 2022, People's United Financial, Inc. operates as a subsidiary of M&T Bank Corporation.",
        "ceo": "John Barnes",
        "sector": "Financial Services",
        "country": "US",
        "fullTimeEmployees": "5193",
        "phone": "12033384114",
        "address": "850 Main St",
        "city": "Bridgeport",
        "state": "CT",
        "zip": "06604",
        "dcfDiff": 0.753321,
        "dcf": 20.1633,
        "image": "https://images.financialmodelingprep.com/symbol/PBCT.png",
        "ipoDate": "1988-01-07",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]