[
    {
        "symbol": "RAD",
        "price": 0.6483,
        "beta": 1.286899,
        "volAvg": 7665379,
        "mktCap": 36756211,
        "lastDiv": 0,
        "range": "0.38-7.37",
        "changes": -0.131,
        "companyName": "Rite Aid Corporation",
        "currency": "USD",
        "cik": "0000084129",
        "isin": "US7677548726",
        "cusip": "767754872",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Medical - Pharmaceuticals",
        "website": "https://www.riteaid.com",
        "description": "Rite Aid Corporation, through its subsidiaries, operates a chain of retail drugstores in the United States. The company operates through two segments, Retail Pharmacy and Pharmacy Services. The Retail Pharmacy segment sells prescription drugs and provides various other pharmacy services and an assortment of products comprising over-the-counter medications, health and beauty aids, personal care products, seasonal merchandise, cosmetics, household items, food and beverages, greeting cards, seasonal and general merchandise, pet care, and a variety of other everyday and convenience products, as well as brand and generic prescription drugs; and a private brand product line. It also operates retail pharmacies and clinics; and offers healthcare services, including administering immunizations for COVID-19, the flu, shingles, and others; assists its customers with high blood pressure, cholesterol, and diabetes; provides guidance on combating obesity and tobacco addiction; and educates customers on managing medications and potential side effects. In addition, this segment offers healthcare coaching and disease management services to health plans and employers. The Pharmacy Services segment provides integrated suite of pharmacy benefit management (PBM) offerings, including technology solutions, mail delivery services, specialty pharmacy, network and rebate administration, claims adjudication, and pharmacy discount programs, as well as drug benefits under the federal government's Medicare Part D program and insurance offerings for individuals and groups. This segment serves health plans, commercial employers, labor groups, and state and local governments. As of February 26, 2022, the company operated 2,450 retail pharmacy locations in 17 states. Rite Aid Corporation was founded in 1962 and is headquartered in Philadelphia, Pennsylvania.",
        "ceo": "Elizabeth H. Burr",
        "sector": "Healthcare",
        "country": "US",
        "fullTimeEmployees": "47000",
        "phone": "17177612633",
        "address": "1200 Intrepid Avenue",
        "city": "Philadelphia",
        "state": "PA",
        "zip": null,
        "dcfDiff": 2.44483,
        "dcf": 6.03483,
        "image": "https://images.financialmodelingprep.com/symbol/RAD.png",
        "ipoDate": "1980-03-17",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]