[
    {
        "symbol": "RRD",
        "price": 10.84,
        "beta": 2.469915,
        "volAvg": 1990404,
        "mktCap": 0,
        "lastDiv": 26.734999999999985,
        "range": "10.81-10.9",
        "changes": 0,
        "companyName": "R. R. Donnelley & Sons Company",
        "currency": "USD",
        "cik": "0000029669",
        "isin": "US2578672006",
        "cusip": "257867200",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Specialty Business Services",
        "website": "https://www.rrd.com",
        "description": "R. R. Donnelley & Sons Company, an integrated communications provider, enables organizations to create, manage, deliver, and optimize their multichannel marketing and business communications. Its Business Services segment offers commercial printing products and branded materials, including manuals, publications, brochures, business cards, flyers, post cards, posters, and promotional items; and packaging solutions comprising rigid boxes and in-box print materials for clients in the consumer electronics, life sciences, cosmetics, and consumer packaged goods industries. It also provides and distribution, shipping, healthcare, durable goods, promotional, and consumer product goods packaging labels; and customer billings, financial statements, healthcare communications, and insurance document statement printing services. In addition, this segment offers workflow design, assembly, configuration, kitting, and fulfillment services for clients in the life sciences and healthcare, consumer electronics, telecommunications, cosmetics, education, and industrial industries. Further, it provides invoices, order, and business forms that support the private and public sectors; and outsourcing services, such as creative services, research and analytics, financial management, and other services for legal providers, insurance, telecommunications, utilities, retail, and financial services companies. The company's Marketing Solutions segment offers direct marketing, such as audience segmentation, creative development, program testing, print production, postal optimization, and performance analytics for large-scale personalized direct mail programs; and in-store marketing, digital print, kitting, fulfillment, digital, and creative solutions and list services. It operates in the United States, Asia, Europe, and internationally. The company was founded in 1864 and is headquartered in Chicago, Illinois.",
        "ceo": "Daniel Knotts",
        "sector": "Industrials",
        "country": "US",
        "fullTimeEmployees": "32000",
        "phone": "13123268000",
        "address": "35 W Wacker Dr",
        "city": "Chicago",
        "state": "IL",
        "zip": "60601",
        "dcfDiff": 3.76107,
        "dcf": 14.6011,
        "image": "https://images.financialmodelingprep.com/symbol/RRD.png",
        "ipoDate": "1992-05-01",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]