[
    {
        "symbol": "SBNY",
        "price": 0.65,
        "beta": 9.391,
        "volAvg": 56812,
        "mktCap": 78455155,
        "lastDiv": 0,
        "range": "0.001-1.75",
        "changes": 0.05,
        "companyName": "Signature Bank",
        "currency": "USD",
        "cik": "0001288784",
        "isin": "US82669G1040",
        "cusip": "82669G104",
        "exchange": "Other OTC",
        "exchangeShortName": "OTC",
        "industry": "Banks - Regional",
        "website": "https://www.signatureny.com",
        "description": "Signature Bank provides commercial banking products and services. It accepts various deposit products, including checking accounts, money market accounts, escrow deposit accounts, cash concentration accounts, certificates of deposit, and other cash management products. The company provides various lending products comprising commercial and industrial loans, real estate loans, and letters of credit. In addition, it offers asset management and investment products; and retirement products, such as individual retirement accounts and administrative services for retirement vehicles. Further, the company provides wealth management services to its high net worth personal clients; and purchases, sells, and assembles small business administration loans and pools. Additionally, it offers individual and group insurance products, including health, life, disability, and long-term care insurance products for business and private clients. As of December 31, 2021, the company operated 37 private client offices located in the metropolitan New York area, Connecticut, California, and North Carolina. Signature Bank was incorporated in 2000 and is headquartered in New York, New York.",
        "ceo": "Joseph John DePaolo",
        "sector": "Financial Services",
        "country": "US",
        "fullTimeEmployees": "2243",
        "phone": "646 822 1500",
        "address": "565 Fifth Avenue",
        "city": "New York City",
        "state": "NY",
        "zip": "10017",
        "dcfDiff": 564.558,
        "dcf": 691.948,
        "image": "https://images.financialmodelingprep.com/symbol/SBNY.png",
        "ipoDate": "2004-03-23",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]