[
    {
        "symbol": "TA",
        "price": 86,
        "beta": 1.453905,
        "volAvg": 535941,
        "mktCap": 1298565600,
        "lastDiv": 0,
        "range": "31.19-88.55",
        "changes": 0,
        "companyName": "TravelCenters of America Inc.",
        "currency": "USD",
        "cik": "0001378453",
        "isin": "US89421B1098",
        "cusip": "89421B109",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Specialty Retail",
        "website": "https://www.ta-petro.com",
        "description": "TravelCenters of America Inc. operates travel centers, truck service facilities, and restaurants in the United States and Canada. The company's travel centers offer various products and services, including diesel fuel and gasoline, as well as nonfuel products and services, such as a range of truck repair and maintenance services, diesel exhaust fluids, full service restaurants, quick service restaurants, and various customer amenities. Its full and quick service restaurants are operated under the Iron Skillet, Country Pride, IHOP, Black Bear Diner, Fuddruckers, Bob Evans, Popeye's Chicken & Biscuits, Subway, Burger King, Taco Bell, Pizza Hut, Dunkin' and Starbuck's Coffee brands. The company's travel stores offer general merchandise, including electronics, oil and additives, hardware and tools, clothing, and cab and bunk supplies; convenience products comprise cold beverages, candy, salty snacks, and sweet treats, as well as grocery items, such as meal solutions, pet supplies, and health and beauty products; and fresh food, pre-packaged meal solutions, snacks, freshly brewed coffee, cold fountain drinks, and gifts and regional souvenirs. In addition, it operates parking space under the Reserve-It brand name. As of May 5, 2022, the company operated 276 travel centers under the TravelCenters of America, TA, TA Express, Petro Stopping Centers, and Petro brand names in 44 states in the United States, as well as in the province of Ontario, Canada; three truck service facilities operated under the TA Truck Service brand name; and one restaurant. It serves trucking fleets and its drivers, independent truck drivers, highway and local motorists, and casual diners. TravelCenters of America Inc. was founded in 1972 and is based in Westlake, Ohio.",
        "ceo": "Jonathan M. Pertchik",
        "sector": "Consumer Cyclical",
        "country": "US",
        "fullTimeEmployees": "15945",
        "phone": "440 808 9100",
        "address": "24601 Center Ridge Road",
        "city": "Westlake",
        "state": "OH",
        "zip": "44145-5639",
        "dcfDiff": 53.1808,
        "dcf": 97.8608,
        "image": "https://images.financialmodelingprep.com/symbol/TA.png",
        "ipoDate": "2007-01-29",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]