[
    {
        "symbol": "TG",
        "price": 6.57,
        "beta": 0.727,
        "volAvg": 115937,
        "mktCap": 228465568,
        "lastDiv": 0,
        "range": "6.45-9.43",
        "changes": -0.34,
        "companyName": "Tredegar Corporation",
        "currency": "USD",
        "cik": "0000850429",
        "isin": "US8946501009",
        "cusip": "894650100",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Manufacturing - Metal Fabrication",
        "website": "https://www.tredegar.com",
        "description": "Tredegar Corporation, through its subsidiaries, manufactures and sells aluminum extrusions, polyethylene (PE) films, and polyester films in the United States and internationally. It operates through three segments: Aluminum Extrusions, PE Films, and Flexible Packaging Films. The Aluminum Extrusions segment produces soft-alloy and medium-strength custom fabricated and finished aluminum extrusions for the building and construction, automotive and transportation, consumer durables, machinery and equipment, electrical and renewable energy, and distribution markets; and manufactures mill, anodized, and painted and fabricated aluminum extrusions to fabricators and distributors. The PE Films segment offers single- and multi-layer surface protection films for protecting components of flat panel displays that are used in televisions, monitors, notebooks, smart phones, tablets, e-readers, and digital signage under the UltraMask, ForceField, ForceField PEARL, and Pearl A brands. This segment also provides thin-gauge films as overwrap for bathroom tissue and paper towels, as well as polyethylene overwrap films and films for other markets. The Flexible Packaging Films segment offers polyester-based films for food packaging and industrial applications under the Terphane, Ecophane, and Sealphane brands. Tredegar Corporation was founded in 1955 and is headquartered in Richmond, Virginia.",
        "ceo": "John M. Steitz",
        "sector": "Industrials",
        "country": "US",
        "fullTimeEmployees": "1500",
        "phone": "804 330 1000",
        "address": "1100 Boulders Parkway",
        "city": "Richmond",
        "state": "VA",
        "zip": "23225",
        "dcfDiff": 5.66522,
        "dcf": 0.9847828052299812,
        "image": "https://images.financialmodelingprep.com/symbol/TG.png",
        "ipoDate": "1989-07-05",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]