[
    {
        "symbol": "UIS",
        "price": 3.47,
        "beta": 1.34,
        "volAvg": 699132,
        "mktCap": 247386790,
        "lastDiv": 0,
        "range": "3.42-8.93",
        "changes": -0.1,
        "companyName": "Unisys Corporation",
        "currency": "USD",
        "cik": "0000746838",
        "isin": "US9092143067",
        "cusip": "909214306",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Information Technology Services",
        "website": "https://www.unisys.com",
        "description": "Unisys Corporation, together with its subsidiaries, operates as an information technology services company worldwide. It operates in Digital Workplace Solutions (DWS); Cloud and Infrastructure Solutions (C&I); and Enterprise Computing Solutions (ECS) segments. The DWS segment provides solutions that transform digital workplaces securely and create exceptional end-user experiences. The C&I segment offers solutions that drive modern IT service platforms, cloud applications development, intelligent services, and cybersecurity services. The ECS segment provides solutions that harness secure, continuous high-intensity computing, and enable digital services through software-defined operating environments. Its solutions include Unisys InteliServe, a service solution that transforms traditional service desk into an intelligent, user-centric experience aligned with the needs of the modern digital workplace; Unisys CloudForte, a comprehensive managed service offering to help accelerate the secure move of data and applications to the cloud; PowerSuite, a packaged software tool used by enterprise IT to monitor, analyze, troubleshoot and secure collaboration, and communications multi-platform environments; Unisys ClearPath Forward, a software operating environment for high-intensity enterprise computing; and Unisys Stealth security software, which enables trusted identities to access micro-segmented critical assets and safely communicate through secure and encrypted channels. In addition, the company provides industry solutions, which help law enforcement agencies solve crime; social services case workers assist families; travel and transportation companies manage freight and distribution; and financial institutions deliver omnichannel banking. It serves customers in the government, financial services, and commercial markets through direct sales force, distributors, resellers, and alliance partners. Unisys Corporation was founded in 1886 and is based in Blue Bell, Pennsylvania.",
        "ceo": "Debra Winkler McCann",
        "sector": "Technology",
        "country": "US",
        "fullTimeEmployees": "15900",
        "phone": "215 986 4011",
        "address": "801 Lakeview Drive",
        "city": "Blue Bell",
        "state": "PA",
        "zip": "19422",
        "dcfDiff": 6.37677,
        "dcf": -2.1017683146878383,
        "image": "https://images.financialmodelingprep.com/symbol/UIS.png",
        "ipoDate": "1972-06-01",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]