[
    {
        "symbol": "ABMD",
        "price": 381.02,
        "beta": 0,
        "volAvg": 1703123,
        "mktCap": 17180649405,
        "lastDiv": 0,
        "range": "219.845-381.99",
        "changes": 0,
        "companyName": "Abiomed, Inc.",
        "currency": "USD",
        "cik": "0000815094",
        "isin": "US0036541003",
        "cusip": "003654100",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Medical - Devices",
        "website": "https://www.abiomed.com",
        "description": "Abiomed, Inc. engages in the research, development, and sale of medical devices to assist or replace the pumping function of the failing heart. It also provides a continuum of care to heart failure patients. The company offers Impella 2.5, a percutaneous micro heart pump with integrated motor and sensors; and Impella CP, a device for use by interventional cardiologists to support patients in the cath lab, as well as by cardiac surgeons in the heart surgery suite. It also provides Impella 5.0, Impella LD, and Impella 5.5, which are percutaneous micro heart pumps with integrated motors and sensors for use primarily in the heart surgery suite; Impella RP, a percutaneous catheter-based axial flow pump; Impella SmartAssist platform that includes optical sensor technology for improved pump positioning and the use of algorithms that enable improved native heart assessment during the weaning process; Impella Connect, a cloud-based technology that enables secure and remote viewing of the automated impella controller for physicians and hospital staffs; and OXY-1 System, a portable external respiratory assistance device. In addition, the company is developing Impella ECP, a pump for blood flow of greater than three liters per minute; Impella XR Sheath, a sheath that expands and recoils allowing small bore access and closure with Impella heart pumps; Impella BTR, a percutaneous micro heart pump with integrated motors and sensors; and preCARDIA, a catheter-mounted superior vena cava therapy system designed to rapidly treat acutely decompensated heart failure. Abiomed, Inc. sells its products through direct sales and clinical support personnel in the Germany, France, United States, Japan, Europe, Canada, Latin America, the Asia-Pacific, and the Middle East. The company was founded in 1981 and is headquartered in Danvers, Massachusetts. As of December 22, 2022, Abiomed, Inc. operates as a subsidiary of Johnson & Johnson.",
        "ceo": "Michael Minogue",
        "sector": "Healthcare",
        "country": "US",
        "fullTimeEmployees": "2003",
        "phone": "19787775410",
        "address": "22 CHERRY HILL DR",
        "city": "Danvers",
        "state": "MA",
        "zip": "01923",
        "dcfDiff": 1.50517,
        "dcf": 379.515,
        "image": "https://images.financialmodelingprep.com/symbol/ABMD.png",
        "ipoDate": "1987-07-29",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]