[
    {
        "symbol": "COMS",
        "price": 0.0013,
        "beta": 1.543,
        "volAvg": 644,
        "mktCap": 3504,
        "lastDiv": 0,
        "range": "0.0001-0.02",
        "changes": -0.0009,
        "companyName": "COMSovereign Holding Corp.",
        "currency": "USD",
        "cik": "0001178727",
        "isin": "US2056504010",
        "cusip": "205650203",
        "exchange": "Other OTC",
        "exchangeShortName": "OTC",
        "industry": "Telecommunications Services",
        "website": "https://www.comsovereign.com",
        "description": "COMSovereign Holding Corp. provides technologically-advanced telecom solutions for network operators, mobile device carriers, governmental units, and other enterprises worldwide. The company offers packet microwave solutions that transmit broadband voice, video, and data, as well as enable service providers, government agencies, enterprises, and other organizations; and in-band full-duplex technologies that alleviate the performance limitations of the principal transmission technologies. It also provides tethered drones and aerostats for use in intelligence, surveillance, and reconnaissance, as well as communication applications for national defense and security customers; and edge compute capable small cell 4G LTE and 5G access radios. In addition, the company offers maintenance and support services, as well as other professional services, such as engineering, designing, and developing a range of network systems and system components. The company was formerly known as Drone Aviation Holding Corp. and changed its name to COMSovereign Holding Corp. in November 2019. COMSovereign Holding Corp. was incorporated in 2014 and is based in Tucson, Arizona.",
        "ceo": "David A. Knight",
        "sector": "Communication Services",
        "country": "US",
        "fullTimeEmployees": "25",
        "phone": "904 834 4400",
        "address": "6890 E Sunrise Drive",
        "city": "Tucson",
        "state": "AZ",
        "zip": "85750",
        "dcfDiff": 0.59116,
        "dcf": -0.2607578291448638,
        "image": "https://images.financialmodelingprep.com/symbol/COMS.png",
        "ipoDate": "2008-08-15",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]