[
    {
        "symbol": "CVA",
        "price": 20.26,
        "beta": 1.366233,
        "volAvg": 1039985,
        "mktCap": 0,
        "lastDiv": 9.899999999999999,
        "range": "20.23-20.26",
        "changes": 0.0200005,
        "companyName": "Covanta Holding Corporation",
        "currency": "USD",
        "cik": "0000225648",
        "isin": "US22282E1029",
        "cusip": "22282E102",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Waste Management",
        "website": "http://www.covanta.com",
        "description": "Covanta Holding Corporation, through its subsidiaries, provides waste and energy services to municipal entities primarily in the United States and Canada. It owns and operates infrastructure for the conversion of waste to energy, as well as engages in related waste transport and disposal, and other renewable energy production businesses. The company disposes waste and generates electricity and/or steam; sells metal recovered during the energy-from-waste (EfW) process; and offers waste management solutions, such as site clean-up, wastewater treatment, pharmaceutical and healthcare solutions, reverse distribution, transportation and logistics, recycling, and depackaging. As of December 31, 2019, it owned and operated 41 EfW operations, 14 transfer stations, 20 material processing facilities, four landfills, two wood waste energy projects, one regional metals recycling facility, and one ash processing facility. Covanta Holding Corporation has a strategic partnership with the Green Investment Group Limited to develop EfW projects in Ireland and the United Kingdom. The company was formerly known as Danielson Holding Corporation and changed its name to Covanta Holding Corporation in September 2005. Covanta Holding Corporation was incorporated in 1992 and is headquartered in Morristown, New Jersey.",
        "ceo": "Stephen Jones",
        "sector": "Industrials",
        "country": "US",
        "fullTimeEmployees": "4000",
        "phone": "18623455000",
        "address": "445 South St",
        "city": "Morristown",
        "state": "NJ",
        "zip": "07960",
        "dcfDiff": 0.416666,
        "dcf": 20.6767,
        "image": "https://images.financialmodelingprep.com/symbol/CVA.png",
        "ipoDate": "1990-12-06",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]