[
    {
        "symbol": "FMCC",
        "price": 10.35,
        "beta": 0.7005734,
        "volAvg": 3925400,
        "mktCap": 6728116374,
        "lastDiv": 0,
        "range": "1.12-14.99",
        "changes": 0.82,
        "companyName": "Federal Home Loan Mortgage Corporation",
        "currency": "USD",
        "cik": "0001026214",
        "isin": "US3134003017",
        "cusip": "313400301",
        "exchange": "Other OTC",
        "exchangeShortName": "OTC",
        "industry": "Financial - Mortgages",
        "website": "https://www.freddiemac.com",
        "description": "Federal Home Loan Mortgage Corporation operates in the secondary mortgage market in the United States. The company purchases single-family and multifamily residential mortgage loans originated by lenders, as well as invests in mortgage loans and mortgage-related securities. It operates through two segments, Single-family and Multifamily. The Single-family segment purchases, securitizes, and guarantees single-family loans; and manages single-family mortgage credit risk, as well as manages mortgage-related investments portfolio, single-family securitization activities, and treasury functions. This segment serves mortgage banking companies, commercial banks, regional banks, community banks, credit unions, housing finance agencies, savings institutions, and non-depository financial institutions. The Multifamily segment engages in the purchase, sale, securitization, and guarantee of multifamily loans and securities through the issuance of multifamily K and SB certificates; issuing and guarantying other securitization products; issuing other credit risk transfer products; and provision of other mortgage-related guarantees. It serves banks and other depository institutions, insurance companies, money managers, central banks, pension funds, state and local governments, real estate investment trusts, brokers and dealers, and a range of lenders. The company was founded in 1970 and is headquartered in McLean, Virginia.",
        "ceo": "Michael Thomas Hutchins",
        "sector": "Financial Services",
        "country": "US",
        "fullTimeEmployees": "8076",
        "phone": "703 903 2000",
        "address": "8200 Jones Branch Drive",
        "city": "McLean",
        "state": "VA",
        "zip": "22102-3110",
        "dcfDiff": null,
        "dcf": 1.02345,
        "image": "https://images.financialmodelingprep.com/symbol/FMCC.png",
        "ipoDate": "1988-12-02",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]