[
    {
        "symbol": "FNMA",
        "price": 11.31,
        "beta": 1.714,
        "volAvg": 7378000,
        "mktCap": 13097970383,
        "lastDiv": 0,
        "range": "1.2-15.99",
        "changes": 1.11,
        "companyName": "Federal National Mortgage Association",
        "currency": "USD",
        "cik": "0000310522",
        "isin": "US3135861090",
        "cusip": "313586109",
        "exchange": "Other OTC",
        "exchangeShortName": "OTC",
        "industry": "Financial - Mortgages",
        "website": "https://www.fanniemae.com",
        "description": "Federal National Mortgage Association provides a source of financing for mortgages in the United States. It securitizes mortgage loans originated by lenders into Fannie Mae mortgage-backed securities (Fannie Mae MBS). The company operates through two segments, Single-Family and Multifamily. The Single-Family segment securitizes and purchases single-family fixed-rate or adjustable-rate, first-lien mortgage loans, or mortgage-related securities backed by these loans; and loans that are insured by Federal Housing Administration, loans guaranteed by the Department of Veterans Affairs and Rural Development Housing and Community Facilities Program of the U.S. Department of Agriculture, manufactured housing mortgage loans, and other mortgage-related securities. This segment also provides single-family mortgage servicing, as well as credit risk and loss management services. The Multifamily segment securitizes multifamily mortgage loans into Fannie Mae MBS; purchases multifamily mortgage loans; and provides credit enhancement for bonds issued by state and local housing finance authorities to finance multifamily housing. This segment also issues structured MBS backed by Fannie Mae multifamily MBS; buys and sells multifamily agency mortgage-backed securities; invests in low-income housing tax credit (LIHTC) multifamily projects; and offers delegated underwriting and servicing, as well as multifamily mortgage, and credit risk and loss management services. The company serves mortgage banking companies, savings and loan associations, savings banks, commercial banks, credit unions, community banks, insurance companies, private mortgage originators, and state and local housing finance agencies. Federal National Mortgage Association was founded in 1938 and is headquartered in Washington, the District of Columbia.",
        "ceo": "Priscilla Almodovar",
        "sector": "Financial Services",
        "country": "US",
        "fullTimeEmployees": "8200",
        "phone": "800 232 6643",
        "address": "Midtown Center",
        "city": "Washington",
        "state": "DC",
        "zip": "20005",
        "dcfDiff": null,
        "dcf": 0,
        "image": "https://images.financialmodelingprep.com/symbol/FNMA.png",
        "ipoDate": "1977-01-03",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]