[
    {
        "symbol": "FOSL",
        "price": 2.06,
        "beta": 2.177,
        "volAvg": 1024078,
        "mktCap": 110776170,
        "lastDiv": 0,
        "range": "0.86-4.4",
        "changes": -0.02,
        "companyName": "Fossil Group, Inc.",
        "currency": "USD",
        "cik": "0000883569",
        "isin": "US34988V1061",
        "cusip": "34988V106",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Luxury Goods",
        "website": "https://www.fossilgroup.com",
        "description": "Fossil Group, Inc., together with its subsidiaries, designs, develops, markets, and distributes consumer fashion accessories in the United States, Europe, Asia, and internationally. The company's products include traditional watches, smartwatches, jewelry, handbags, small leather goods, belts, and sunglasses. It also manufactures and distributes private label brands, as well as purchases and resells branded products in non-FOSSIL branded retail stores. The company offers its products under its proprietary brands, such as FOSSIL, SKAGEN, MICHELE, RELIC, and ZODIAC; and under the licensed brands, including ARMANI EXCHANGE, DIESEL, DKNY, EMPORIO ARMANI, KATE SPADE NEW YORK, MICHAEL KORS, PUMA, TORY BURCH, Skechers, and BMW. The company sells its products through company-owned retail and outlet stores, department stores, specialty retail stores, specialty watch and jewelry stores, mass market stores, e-commerce sites, licensed and franchised FOSSIL retail stores, and retail concessions, as well as sells its products on airlines and cruise ships. As of January 2, 2022, it operated 370 stores worldwide. The company was formerly known as Fossil, Inc. and changed its name to Fossil Group, Inc. in May 2013. Fossil Group, Inc. was founded in 1984 and is headquartered in Richardson, Texas.",
        "ceo": "Franco Fogliato",
        "sector": "Consumer Cyclical",
        "country": "US",
        "fullTimeEmployees": "5200",
        "phone": "972 234 2525",
        "address": "901 South Central Expressway",
        "city": "Richardson",
        "state": "TX",
        "zip": "75080",
        "dcfDiff": 2.8979,
        "dcf": -1.3378020050364887,
        "image": "https://images.financialmodelingprep.com/symbol/FOSL.png",
        "ipoDate": "1993-04-08",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]