[
    {
        "symbol": "FRC",
        "price": 3.51,
        "beta": 1.010726,
        "volAvg": 64633037,
        "mktCap": 653628718,
        "lastDiv": 0.81,
        "range": "0.265-16.36",
        "changes": 0,
        "companyName": "First Republic Bank",
        "currency": "USD",
        "cik": "0001132979",
        "isin": "US33616C1009",
        "cusip": "33616C100",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Banks - Regional",
        "website": "https://www.firstrepublic.com",
        "description": "First Republic Bank, together with its subsidiaries, provides private banking, private business banking, and private wealth management services to clients in metropolitan areas in the United States. It operates in two segments, Commercial Banking and Wealth Management. The company accepts deposit products, such as noninterest-bearing checking, interest-bearing checking, money market checking accounts, money market savings accounts, and passbook accounts, as well as certificates of deposit. It also offers a range of lending products that comprise residential mortgage loans, home equity lines of credit, multifamily loans, commercial real estate and construction loans, personal and business loans, single family construction loans, and other loans and lines of credit to businesses and individuals. The company's loans are secured by single family residences, multifamily buildings, and commercial real estate properties. In addition, it provides wealth management services, which include various investment strategies and products, online investment management, trust and custody, full service and online brokerage, financial and estate planning, and access to alternative investments, as well as investing, insurance, and foreign exchange services. Further, the company offers online and mobile banking services; refinancing services; and ATM and debit cards. As of December 31, 2021, it offered its services through 82 licensed deposit taking offices primarily in the San Francisco, Palo Alto, Los Angeles, Santa Barbara, Newport Beach and San Diego, California; Portland, Oregon; Boston, Massachusetts; Palm Beach, Florida; Greenwich, Connecticut; New York, New York; and Jackson, Wyoming. It also has 12 additional offices that offer lending, wealth management, or trust services. First Republic Bank was founded in 1985 and is headquartered in San Francisco, California.",
        "ceo": "Michael J. Roffler",
        "sector": "Financial Services",
        "country": "US",
        "fullTimeEmployees": "7213",
        "phone": "415 392 1400",
        "address": "111 Pine Street",
        "city": "San Francisco",
        "state": "CA",
        "zip": "94111",
        "dcfDiff": 53.0078,
        "dcf": 194.018,
        "image": "https://images.financialmodelingprep.com/symbol/FRC.png",
        "ipoDate": "2010-12-09",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]