[
    {
        "symbol": "KSU",
        "price": 293.59,
        "beta": 1.104935,
        "volAvg": 1603557,
        "mktCap": 0,
        "lastDiv": 111.01470199999994,
        "range": "289.03-296.96",
        "changes": -5.05002,
        "companyName": "Kansas City Southern",
        "currency": "USD",
        "cik": "0000054480",
        "isin": "US4851703029",
        "cusip": "485170302",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Railroads",
        "website": "https://www.kcsouthern.com",
        "description": "Kansas City Southern, a transportation holding company, provides domestic and international rail transportation services in North America. The company serves a ten-state region in the midwest and southeast regions of the United States and has the shortest north/south rail route between Kansas City, Missouri, and ports along the Gulf of Mexico in Alabama, Louisiana, Mississippi, and Texas. It operates a commercial corridor of the Mexican railroad system and has its direct rail passageway between Mexico City and Laredo, Texas. The company provides rail access to the United States and Mexico border crossing at Nuevo Laredo, Tamaulipas; and controls and operates the southern half of the rail bridge at Laredo, Texas, as well as the northern half of this bridge. Kansas City Southern also provides rail access to the port of Lazaro Cardenas on the Pacific Ocean; and owns a 157-mile rail line extending from Laredo, Texas to the port city of Corpus Christi, Texas. Its rail network comprises approximately 6,700 route miles extending from the Midwest and Southeast portions of the United States south into Mexico. The company serves the chemical and petroleum, industrial and consumer products, agriculture and minerals, energy, intermodal, and automotive markets. Kansas City Southern was founded in 1887 and is headquartered in Kansas City, Missouri.",
        "ceo": "Patrick Ottensmeyer",
        "sector": "Industrials",
        "country": "US",
        "fullTimeEmployees": "6522",
        "phone": "18169831360",
        "address": "427 W 12th St",
        "city": "Kansas City",
        "state": "MO",
        "zip": "64105",
        "dcfDiff": 1.99545,
        "dcf": 295.585,
        "image": "https://images.financialmodelingprep.com/symbol/KSU.png",
        "ipoDate": "2000-07-07",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]