[
    {
        "symbol": "MBI",
        "price": 6.77,
        "beta": 1.556,
        "volAvg": 399965,
        "mktCap": 341808777,
        "lastDiv": 8,
        "range": "3.75-8.26",
        "changes": -0.06,
        "companyName": "MBIA Inc.",
        "currency": "USD",
        "cik": "0000814585",
        "isin": "US55262C1009",
        "cusip": "55262C100",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Insurance - Specialty",
        "website": "https://www.mbia.com",
        "description": "MBIA Inc. provides financial guarantee insurance services to public finance markets. It operates through United States (U.S.) Public Finance Insurance, and International and Structured Finance Insurance segments. The company issues financial guarantees for municipal bonds, including tax-exempt and taxable indebtedness of the U.S. political subdivisions and territories, as well as utilities, airports, health care institutions, higher educational facilities, student loan issuers, housing authorities, and other similar agencies and obligations issued by private entities. It also insures the non-U.S. public finance and global structured finance, including asset-backed obligations; and sovereign-related and sub-sovereign bonds, utilities, and privately issued bonds used for the financing of projects that include toll roads, bridges, airports, public transportation facilities, and other types of infrastructure projects, as well as offers third-party reinsurance services. MBIA Inc. was founded in 1973 and is headquartered in Purchase, New York.",
        "ceo": "William Charles Fallon",
        "sector": "Financial Services",
        "country": "US",
        "fullTimeEmployees": "57",
        "phone": "914 273 4545",
        "address": "1 Manhattanville Road",
        "city": "Purchase",
        "state": "NY",
        "zip": "10577",
        "dcfDiff": 1.83888,
        "dcf": 14.9289,
        "image": "https://images.financialmodelingprep.com/symbol/MBI.png",
        "ipoDate": "1987-07-01",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]