[
    {
        "symbol": "MEI",
        "price": 6.77,
        "beta": 1.097,
        "volAvg": 385876,
        "mktCap": 238396911,
        "lastDiv": 0.4,
        "range": "5.08-17.45",
        "changes": 0.04,
        "companyName": "Methode Electronics, Inc.",
        "currency": "USD",
        "cik": "0000065270",
        "isin": "US5915202007",
        "cusip": "591520200",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Hardware, Equipment & Parts",
        "website": "https://www.methode.com",
        "description": "Methode Electronics, Inc. designs, engineers, and produces mechatronic products worldwide. It operates through four segments: Automotive, Industrial, Interface, and Medical. The Automotive segment supplies electronic and electro-mechanical devices, and related products to automobile original equipment manufacturers directly or through their tiered suppliers. Its products include integrated center consoles, hidden switches, ergonomic switches, transmission lead-frames, and LED-based lighting and sensors, which incorporate magneto-elastic sensing and other technologies that monitor the operation or status of a component or system. The Industrial segment manufactures lighting solutions; industrial safety radio remote controls; braided flexible cables; current-carrying laminated busbars and devices; custom power-product assemblies, such as PowerRail solution; high-current low-voltage flexible power cabling systems; and powder-coated busbars that are used in various markets and applications comprising aerospace, cloud computing, commercial vehicles, industrial, military, power conversion, and transportation. The Interface segment provides various copper-based transceivers and related accessories for the cloud computing hardware equipment and telecommunications broadband equipment markets; user interface solutions for the appliance, commercial food service, and point-of-sale equipment markets; and fluid-level sensors for the marine/recreational vehicle and sump pump markets. The Medical segment offers Dabir Surfaces, a surface support technology aimed at pressure injury prevention for use by patients who are immobilized or otherwise at risk for pressure injuries, including patients undergoing long-duration surgical procedures. Methode Electronics, Inc. was incorporated in 1946 and is headquartered in Chicago, Illinois.",
        "ceo": "Jonathan B. DeGaynor",
        "sector": "Technology",
        "country": "US",
        "fullTimeEmployees": "7500",
        "phone": "708 867 6777",
        "address": "8750 West Bryn Mawr Avenue",
        "city": "Chicago",
        "state": "IL",
        "zip": "60631-3518",
        "dcfDiff": -63.69566,
        "dcf": 84.05065675486934,
        "image": "https://images.financialmodelingprep.com/symbol/MEI.png",
        "ipoDate": "1982-10-20",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]