[
    {
        "symbol": "MTW",
        "price": 10.21,
        "beta": 2.163,
        "volAvg": 297982,
        "mktCap": 362037482,
        "lastDiv": 0,
        "range": "7.06-13.62",
        "changes": 0.04,
        "companyName": "The Manitowoc Company, Inc.",
        "currency": "USD",
        "cik": "0000061986",
        "isin": "US5635714059",
        "cusip": "563571405",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Agricultural - Machinery",
        "website": "https://www.manitowoc.com",
        "description": "The Manitowoc Company, Inc. provides engineered lifting solutions in the Americas, Europe, Africa, the Middle East, and the Asia Pacific. It designs, manufactures, and distributes crawler-mounted lattice-boom cranes under the Manitowoc brand; a line of top-slewing and self-erecting tower cranes under the Potain brand; mobile hydraulic cranes under the Grove, Shuttlelift, and National Crane brands; and hydraulic boom trucks under the National Crane brand. The company also provides crane product parts and services; and crane rebuilding, remanufacturing, and training services. Its crane products are used in various applications, including energy production/distribution and utilities; petrochemical and industrial projects; infrastructure, such as road, bridge, and airport construction; and commercial and high-rise residential construction. The company serves a range of customers, including dealers, rental companies, contractors, and government entities in the petrochemical, industrial, commercial construction, power and utilities, infrastructure, and residential construction end markets. The Manitowoc Company, Inc. was founded in 1902 and is headquartered in Milwaukee, Wisconsin.",
        "ceo": "Aaron H. Ravenscroft",
        "sector": "Industrials",
        "country": "US",
        "fullTimeEmployees": "4800",
        "phone": "414 760 4600",
        "address": "One Park Plaza",
        "city": "Milwaukee",
        "state": "WI",
        "zip": "53224",
        "dcfDiff": 1.14653,
        "dcf": 12.0735,
        "image": "https://images.financialmodelingprep.com/symbol/MTW.png",
        "ipoDate": "1990-03-26",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]