[
    {
        "symbol": "NAC",
        "price": 12.01,
        "beta": 0.554,
        "volAvg": 473298,
        "mktCap": 1738111917,
        "lastDiv": 0.882,
        "range": "10.35-12.02",
        "changes": 0.03,
        "companyName": "Nuveen California Quality Municipal Income Fund",
        "currency": "USD",
        "cik": "0001074952",
        "isin": "US67066Y1055",
        "cusip": "67066Y105",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Asset Management - Income",
        "website": "https://www.nuveen.com/CEF/Product/Overview.aspx?FundCode=NAC&refsrc=vu_nuveen.com/nac",
        "description": "Nuveen California Quality Municipal Income Fund is a closed ended fixed income mutual fund launched by Nuveen Investments, Inc. The fund is co-managed by Nuveen Fund Advisors LLC and Nuveen Asset Management, LLC. It invests in the fixed income markets of California, United States. The fund invests in undervalued municipal securities and other related investments that are exempt from regular federal and California income taxes. It primarily invests in securities that are rated Baa or BBB or better by Moody's Investors Service, Inc. or Standard & Poor's, and have an average maturity of 20.96 years. The fund employs fundamental analysis with a bottom-up approach to create its portfolio. It benchmarks the performance of its portfolio against the Standard & Poor's (S&P) California Municipal Bond Index and Standard & Poor's (S&P) National Municipal Bond Index. The fund was formerly known as Nuveen California Dividend Advantage Municipal Fund. Nuveen California Quality Municipal Income Fund was formed on December 1, 1998 and is domiciled in the United States.",
        "ceo": "",
        "sector": "Financial Services",
        "country": "FR",
        "fullTimeEmployees": null,
        "phone": "312 917 7700",
        "address": "333 West Wacker Drive",
        "city": "Chicago",
        "state": "IL",
        "zip": "60606-1220",
        "dcfDiff": -2.02081,
        "dcf": 13.98921445874237,
        "image": "https://images.financialmodelingprep.com/symbol/NAC.png",
        "ipoDate": "1999-05-26",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": true
    }
]