[
    {
        "symbol": "PAR",
        "price": 35.59,
        "beta": 1.652,
        "volAvg": 954329,
        "mktCap": 1444280530,
        "lastDiv": 0,
        "range": "34.22-82.24",
        "changes": 0.25,
        "companyName": "PAR Technology Corporation",
        "currency": "USD",
        "cik": "0000708821",
        "isin": "US6988841036",
        "cusip": "698884103",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Software - Application",
        "website": "https://www.partech.com",
        "description": "PAR Technology Corporation, together with its subsidiaries, provides technology solutions to the restaurant and retail industries worldwide. The company operates in two segments, Restaurant/Retail and Government. The Restaurant/Retail segment offers point-of-sale (POS) technology solutions, including Brink POS, an open cloud solution that integrates with third party products and in-house systems; Punchh, an enterprise-grade customer loyalty and engagement solution for restaurant and convenience store brands; Data Central, a cloud software solution for back-office applications; PAR Payment Services, a merchant services offering; POS integrated solutions for wireless headsets for drive-thru order-taking; and the PAR Infinity, PAR Phase, PAR Helix, and the EverServ 8000 series platform. This segment also offers training, installation, technical support, and repair services. The Government segment provides intelligence, surveillance, and reconnaissance solutions; systems engineering support and software-based solutions; satellite and teleport facility operations and maintenance, engineering, and installation services; satellite control center; and information technology infrastructure library services to the Unites States Department of Defense and other federal agencies, as well as offers licensed software products. It offers products and services through its sales teams, channel partners, and resellers. The company was founded in 1968 and is headquartered in New Hartford, New York.",
        "ceo": "Savneet Singh",
        "sector": "Technology",
        "country": "US",
        "fullTimeEmployees": "1581",
        "phone": "315 738 0600",
        "address": "PAR Technology Park",
        "city": "New Hartford",
        "state": "NY",
        "zip": "13413-4991",
        "dcfDiff": 83.21155,
        "dcf": -41.42154858062626,
        "image": "https://images.financialmodelingprep.com/symbol/PAR.png",
        "ipoDate": "1982-12-03",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]