[
    {
        "symbol": "PCLB",
        "price": 32.35,
        "beta": 0.316,
        "volAvg": 93,
        "mktCap": 29061170,
        "lastDiv": 1.08,
        "range": "27.85-34.7",
        "changes": 0,
        "companyName": "Pinnacle Bancshares, Inc.",
        "currency": "USD",
        "cik": null,
        "isin": "US7229031015",
        "cusip": "722903101",
        "exchange": "Other OTC",
        "exchangeShortName": "OTC",
        "industry": "Banks - Regional",
        "website": "https://www.pinnaclebanc.com",
        "description": "Pinnacle Bancshares, Inc. operates as the bank holding company for Pinnacle Bank that provides various banking products and services. The company provides checking accounts, savings accounts, and demand and time deposits. It also offers personal lending for automobile, boat, jet ski, motor home, travel trailers, manufactured home, tractor, ATV, personal line of credit, and others; mortgage products, such as residential purchase and refinance, investment property, consumer construction, consumer 2nd mortgage, veterans administration loans, federal housing administration loans, land loans, home equity line of credit, and home improvement/renovation; commercial lending products, including purchase, construction, and refinance of residential rental property and commercial real estate, as well as residential rental property improvements, land acquisition, investment, and development; commercial construction; and SBA lending. In addition, the company provides digital banking, card, cash management, and merchant services. It operates seven offices in the central and northwest Alabama. Pinnacle Bancshares, Inc. was incorporated in 1996 and is based in Jasper, Alabama.",
        "ceo": "Robert B. Nolen Jr.",
        "sector": "Financial Services",
        "country": "US",
        "fullTimeEmployees": "96",
        "phone": "205 221 4111",
        "address": "1811 Second Avenue",
        "city": "Jasper",
        "state": "AL",
        "zip": "35501",
        "dcfDiff": -35.94547,
        "dcf": 68.29546698185553,
        "image": "https://images.financialmodelingprep.com/symbol/PCLB.png",
        "ipoDate": "1986-12-17",
        "defaultImage": true,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]