[
    {
        "symbol": "RLGY",
        "price": 12.08,
        "beta": 2.470961,
        "volAvg": 1605116,
        "mktCap": 1322530480,
        "lastDiv": 1.17,
        "range": "11.99-12.34",
        "changes": -0.17,
        "companyName": "Realogy Holdings Corp.",
        "currency": "USD",
        "cik": "0001398987",
        "isin": "US75605Y1064",
        "cusip": "75605Y106",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Real Estate - Services",
        "website": "https://www.realogy.com",
        "description": "Realogy Holdings Corp., through its subsidiaries, provides residential real estate services. It operates through three segments: Realogy Franchise Group, and Realogy Brokerage Group. The Realogy Franchise Group segment franchises its residential real estate brokerages under the Century 21, Coldwell Banker, Coldwell Banker Commercial, Corcoran, ERA, Sotheby's International Realty, and Better Homes and Gardens Real Estate brand names. This segment also offers lead generation and relocation services. As of December 31, 2020, this segment's real estate franchise systems and proprietary brands had approximately 20,100 offices and 320,700 independent sales agents worldwide. The Realogy Brokerage Group segment owns and operates a full-service residential real estate brokerage business under the Coldwell Banker, Corcoran, and Sotheby's International Realty brand names to assist home buyers and sellers in the listing, marketing, selling, and finding homes. As of December 31, 2020, this segment owned and operated 670 brokerage offices with approximately 53,100 independent sales agents. The Realogy Title Group segment provides title, escrow, and settlement services to real estate companies, corporations, and financial institutions. This segment also serves as an underwriter of title insurance policies in connection with residential and commercial real estate transactions. Realogy Holdings Corp. was incorporated in 2006 and is headquartered in Madison, New Jersey.",
        "ceo": "Ryan Schneider",
        "sector": "Real Estate",
        "country": "US",
        "fullTimeEmployees": "9665",
        "phone": "19734072000",
        "address": "175 Park Ave",
        "city": "Madison New Jersey",
        "state": "NJ",
        "zip": "07940-1123",
        "dcfDiff": 6.38021,
        "dcf": 18.4602,
        "image": "https://images.financialmodelingprep.com/symbol/RLGY.png",
        "ipoDate": "2012-10-11",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]