[
    {
        "symbol": "SEG",
        "price": 24,
        "beta": 1.9690917,
        "volAvg": 90520,
        "mktCap": 305569848,
        "lastDiv": 0,
        "range": "16.52-34.51",
        "changes": -0.07,
        "companyName": "Seaport Entertainment Group Inc.",
        "currency": "USD",
        "cik": "0002009684",
        "isin": "US8122152007",
        "cusip": "812215200",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Real Estate - Services",
        "website": "https://www.seaportentertainment.com",
        "description": "Seaport Entertainment Group Inc. owns, develops, and operates a portfolio of entertainment and real estate assets primarily in New York City and Las Vegas. The company operates through three segments: Landlord Operations; Hospitality; and Sponsorships, Events, and Entertainment. The Landlord Operations segment engages in the holding of ownership interests in and operation of physical real estate assets, such as restaurant, retail, office, and entertainment properties, as well as residential units. The Hospitality segment operates six fine dining and casual dining restaurants, cocktail bars, and nightlife and entertainment venues under The Fulton, Mister Dips, Carne Mare, Malibu Farm, Gitano, and The Lawn Club brands; and the Tin Building, which offers restaurants, bars, grocery markets, retail, and private dining experiences. The Sponsorships, Events, and Entertainment segment includes the Las Vegas Aviators Triple-A Minor League Baseball team, the Las Vegas Ballpark, the Fashion Show Mall Air Rights, Seaport events, and concerts, as well as various sponsorship agreements across the Seaport and the Las Vegas Ballpark. Seaport Entertainment Group Inc. was incorporated in 2024 and is headquartered in New York, New York.",
        "ceo": "Anton D. Nikodemus",
        "sector": "Real Estate",
        "country": "US",
        "fullTimeEmployees": "180",
        "phone": "212 732 8257",
        "address": "199 Water Street",
        "city": "New York City",
        "state": "DE",
        "zip": "10038",
        "dcfDiff": null,
        "dcf": 0,
        "image": "https://images.financialmodelingprep.com/symbol/SEG.png",
        "ipoDate": "2024-07-29",
        "defaultImage": true,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]