[
    {
        "symbol": "SSP",
        "price": 2.35,
        "beta": 1.054,
        "volAvg": 638851,
        "mktCap": 207824022,
        "lastDiv": 0,
        "range": "1.36-4.17",
        "changes": -0.08,
        "companyName": "The E.W. Scripps Company",
        "currency": "USD",
        "cik": "0000832428",
        "isin": "US8110544025",
        "cusip": "811054402",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Broadcasting",
        "website": "https://www.scripps.com",
        "description": "The E.W. Scripps Company, together with its subsidiaries, operates as a media enterprise through a portfolio of local and national media brands. The company operates through Local Media, Scripps Network, and Other segments. The Local Media segment operates broadcast television stations, which produce news, information, and entertainment content, as well as its related digital operations. This segment also runs network, syndicated, and original programming. The Scripps Network segment comprises of national television networks. The Network operates through over-the-air broadcast, cable/satellite, connected TV, and digital distribution. In addition, the company provides content and services through the internet, smartphones, and tablets. Further, the company provides Newsy, a national news network, which provides politics, entertainment, science, and technology news; and Scripps National Spelling Bee, an investigative reporting newsroom in Washington, D.C. Additionally, the company offers ION, a national broadcast television network that delivers popular crime and justice procedural programming through over-the-air broadcast and pay TV platforms. It serves audiences and businesses. The E.W. Scripps Company operates through a network of 61 television stations. The company was founded in 1878 and is headquartered in Cincinnati, Ohio.",
        "ceo": "Adam P. Symson",
        "sector": "Communication Services",
        "country": "US",
        "fullTimeEmployees": "5000",
        "phone": "513 977 3000",
        "address": "Scripps Center",
        "city": "Cincinnati",
        "state": "OH",
        "zip": "45202",
        "dcfDiff": -2.24639,
        "dcf": 4.256386769221877,
        "image": "https://images.financialmodelingprep.com/symbol/SSP.png",
        "ipoDate": "1988-06-30",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
]