[
    {
        "symbol": "SYN",
        "price": 1.02,
        "beta": 1.388725,
        "volAvg": 160387,
        "mktCap": 16160982,
        "lastDiv": 0,
        "range": "0.7-4.55",
        "changes": 0.01,
        "companyName": "Synthetic Biologics, Inc.",
        "currency": "USD",
        "cik": "0000894158",
        "isin": "US87164U4094",
        "cusip": "87164U409",
        "exchange": "New York Stock Exchange Arca",
        "exchangeShortName": "AMEX",
        "industry": "Biotechnology",
        "website": "https://www.syntheticbiologics.com",
        "description": "Synthetic Biologics, Inc., a clinical-stage company, develops therapeutics to treat diseases in areas of high unmet need. The company's lead product candidates include SYN-004 designed to degrade various commonly used intravenous beta-lactam antibiotics in gastrointestinal (GI) tract for the prevention of microbiome damage, clostridium difficile infection (CDI), overgrowth of pathogenic organisms, the emergence of antimicrobial resistance (AMR), and acute graft-versus-host-disease (aGVHD) in allogeneic hematopoietic cell transplant recipients; and SYN-020, a recombinant oral formulation for the enzyme intestinal alkaline phosphatase to treat both local GI and systemic diseases. It also develops VCN-01 for the treatment of patients with pancreatic cancer, head and neck squamous cell carcinoma, colorectal cancer, and retinoblastoma. In addition, the company develops clinical stage products, such as SYN-006 to prevent aGVHD and infection by carbapenem resistant enterococci; SYN-007 for preventing antibiotic associated diarrhea with oral ß-lactam antibiotics; SYN-005 for the prevention and treatment of pertussis; and VCN-11 to treat cancer. It has collaborations with Intrexon Corporation, The University of Texas at Austin, and Cedars-Sinai Medical Center; and a clinical trial agreement with Washington University School of Medicine in St. Louis to conduct a Phase 1b/2a clinical trial of SYN-004. Synthetic Biologics, Inc. is headquartered in Rockville, Maryland.",
        "ceo": "Steven Shallcross",
        "sector": "Healthcare",
        "country": "US",
        "fullTimeEmployees": "16",
        "phone": "17343327800",
        "address": "9605 Medical Center Dr Ste 270",
        "city": "Rockville",
        "state": "MD",
        "zip": "20850",
        "dcfDiff": 0.55241,
        "dcf": 1.57241,
        "image": "https://images.financialmodelingprep.com/symbol/SYN.png",
        "ipoDate": "1993-02-12",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]