[
    {
        "symbol": "TWTR",
        "price": 53.7,
        "beta": 0,
        "volAvg": 32339509,
        "mktCap": 41093709770,
        "lastDiv": 0,
        "range": "31.3-54.57",
        "changes": 0,
        "companyName": "Twitter, Inc. (delisted)",
        "currency": "USD",
        "cik": "0001418091",
        "isin": "US90184L1026",
        "cusip": "90184L102",
        "exchange": "New York Stock Exchange",
        "exchangeShortName": "NYSE",
        "industry": "Internet Content & Information",
        "website": "https://www.twitter.com",
        "description": "Twitter, Inc. operates as a platform for public self-expression and conversation in real-time. The company's primary product is Twitter, a platform that allows users to consume, create, distribute, and discover content. It also provides promoted products that enable advertisers to promote brands, products, and services, as well as enable advertisers to target an audience based on various factors, including who an account follows and actions taken on its platform, such as Tweets created and engagement with Tweets. Its promoted products consist of promoted ads and Twitter Amplify, Follower Ads, and Twitter takeover. In addition, the company offers monetization products for creators, including Tips to directly send small one-time payments on Twitter using various payment methods, including bitcoin; Super Follows, a paid monthly subscription, which includes bonus content, exclusive previews, and perks as a way to support and connect with creators on Twitter; and Ticketed Spaces to support creators on Twitter for their time and effort in hosting, speaking, and moderating the public conversation on Twitter Spaces. Further, it offers products for developers and data partners comprising Twitter Developer Platform, a platform that enables developers to build tools for people and businesses using its public application programming interface; and paid access to Twitter data for partners with commercial use cases. Twitter, Inc. was founded in 2006 and is based in San Francisco, California. As of October 27, 2022, Twitter, Inc. was taken private.",
        "ceo": "Jack Dorsey",
        "sector": "Communication Services",
        "country": "US",
        "fullTimeEmployees": "7500",
        "phone": "14152229670",
        "address": "1355 Market St Ste 900",
        "city": "San Francisco",
        "state": "CA",
        "zip": "94103",
        "dcfDiff": 2.7753,
        "dcf": 56.4753,
        "image": "https://images.financialmodelingprep.com/symbol/TWTR.png",
        "ipoDate": "2013-11-07",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    }
]